gdgly/NUC97X_JS/STM32F4xx/DL698/DL698_GET.cpp


#include "../H698/Project698.h"
#include "../DL698/DL698_DataDef.h"
#include "../DL698/DL698_GET.h"
#include "../DL698/DL698_TESAM.h"
#include "../STM32F4xx/STM32F4xx_UART.h"
#include "../Device/MEMRW.h"

#include "../DL698/DL698_Uart.h"
#include "../DL698/DL698_DATALIB.h"
#include "../DL698/DL698_SETLIB.h"
#include "../DL698/DL698_GET_iMeter.h"
#include "../DL698/DL698_GET_4100.h"
#include "../DL698/DL698_GET_6000.h"
#include "../DL698/DL698_GET_F000.h"
#include "../DL698/DL698_GET_EVENT.h"
#include "../MS/MS.h"
#include "../DL698/RM_Record.h"
#include "../Calculate/Calculate.h"

#include "../DL698/CALC_SwitchIn.h"
#include "../DL698/DL698_FILE.h"
#include "../DL698/DL698_GET_SET_ACTION_2000.h"
#include "../DL698/DL698_CONNECT.h"
#include "../DL698/DL698_FactoryTest.h"

#include "../DL698/DL698_JSON.h"

//GET-Request∷=CHOICE
//{
//读取一个对象属性请求             [1] GetRequestNormal，
//读取若干个对象属性请求           [2] GetRequestNormalList，
//读取一个记录型对象属性请求       [3] GetRequestRecord，
//读取若干个记录型对象属性请求	  [4] GetRequestRecordList，
//读取分帧响应的下一个数据块请求	  [5] GetRequestNext
//}
//GET-Response∷=CHOICE
//{
//读取一个对象属性的响应         	[1]  GetResponseNormal，
//读取若干个对象属性的响应       	[2]  GetResponseNormalList，
//读取一个记录型对象属性的响应   	[3]  GetResponseRecord，
//读取若干个记录型对象属性的响应 	[4]  GetResponseRecordList，
//分帧响应一个数据块                	[5]  GetResponseNext
//}

void GET_Request(u32 PORTn)
{
	u32 i;
	u32 x;
	u32 LEN_SA;//服务器地址SA的长度
	u32 TI;//时间标签:0=无,1=有
	u32 LEN_RxAPDU;
	u32 LEN_TxAPDU;
	u32 LENmax_TxSPACE;//最大还可发送的字节数
	u32 LEN_OAD;
	UARTCtrl_TypeDef * UARTCtrl;
	u8 * p8rx;
	u8 * p8tx;
	u8* pDATA;
	u32 OAD;
	ms_Type *ms;
	u16 *p16;
	ClientConnectInfo_TypeDef *ClientConnectInfo;//客户机连接信息

	UARTCtrl=(UARTCtrl_TypeDef *)Get_ADDR_UARTnCtrl(PORTn);
	LENmax_TxSPACE=Get_LEN_UARTnTx(PORTn);//最大还可发送的字节数
	LENmax_TxSPACE-=TxAPDUOffset+1;//1byte上报信息FollowReport OPTIONAL=0 表示没有
#if USE_ClientConnectInfo==0//使用客户机连接信息的客户机最大接收字节:0=不使用,1=使用
	ClientConnectInfo=ClientConnectInfo;
#else
	//客户机接收缓冲长度
	ClientConnectInfo=(ClientConnectInfo_TypeDef*)UARTCtrl->ConnectInfo;//客户机连接信息
	i=ClientConnectInfo->LEN_Rx;
	i=R_Inverse(i,2);//寄存器数据倒序(高低字节调换),入口:Data=寄存器中数据,Byte=需倒序的字节数;返回:倒序后的数据
	if(i<2048)
	{
		i=2048;
	}
	if(i>(TxAPDUOffset+1))
	{//不为0
		i-=(TxAPDUOffset+1);
		if(LENmax_TxSPACE>i)
		{
			LENmax_TxSPACE=i;
		}
	}
#endif
	
	p8rx=(u8 *)Get_ADDR_UARTnRx(PORTn);
	p8tx=(u8 *)Get_ADDR_UARTnTx(PORTn);
	LEN_RxAPDU=p8rx[1]+(p8rx[2]<<8);//除起始字符和结束字符之外的帧字节数
//68 17 00 43  05  01 00 00 00 00 00  10  26 F6 
//05   应用层服务  CHOICE
//01   GET-Request∷=CHOICE
//00   PIID
//40 01 02 00    OAD
//00   TI
//ED 03 16
//
	LEN_SA=p8rx[4];//取地址字节数
	LEN_SA&=0x0f;
	LEN_SA++;
	LEN_RxAPDU-=(LEN_SA+7+3+2);

	if(p8rx[LEN_SA+8+1]!=5)
	{//不是读取分帧响应的下一个数据块请求	  [5] GetRequestNext
		UARTCtrl->GET_Reques_CHOICE=p8rx[LEN_SA+8+1];//原得到请求选择
		if(UARTCtrl->pTxData)//需发送数据缓冲指针(动态分配),分段组织,每段前有2字节段长度
		{
			ms=Get_ms();
			ms->ms_free(UARTCtrl->pTxData);
			UARTCtrl->pTxData=0;
		}
	}
	UARTCtrl->PIID=p8rx[LEN_SA+8+2];//PIID-ACD
	i=p8rx[LEN_SA+8+1];
	switch(i)
	{
		case 1://读取一个对象属性请求             [1] GetRequestNormal，
//GetRequestNormal∷=SEQUENCE
//{
//  服务序号-优先级     PIID，
//  一个对象属性描述符  OAD
//}
//GetResponseNormal∷=SEQUENCE
//{
//  服务序号-优先级-ACD   PIID-ACD，
//  一个对象属性及其结果  A-ResultNormal
//}
//A-ResultNormal∷=SEQUENCE
//{
//  对象属性描述符  OAD，
//  及其结果        Get-Result
//}
//Get-Result∷=CHOICE
//{
//  错误信息  [0]   DAR，
//  数据      [1]   Data
//}
			p8tx+=TxAPDUOffset;//TxAPDU存放开始地址
			p8tx[0]=133;//读取响应         	[133]	GET-Response
			p8tx[1]=1;//[1] GetRequestNormal
			p8tx[2]=UARTCtrl->PIID;//PIID-ACD
			LEN_TxAPDU=3;
			LENmax_TxSPACE-=LEN_TxAPDU;
			
			p8rx+=LEN_SA+8+3;
			//时间标签
			if(p8rx[4]==1)
			{//有时间标签
				i=Uart_TimeTag(p8rx+4+1);//时间标签有效性判断;入口:p8rx指向时间标签;返回:0=有效,1=无效
				if(i)
				{//无效
					p8tx[LEN_TxAPDU+0]=p8rx[0];//OAD
					p8tx[LEN_TxAPDU+1]=p8rx[1];//OAD
					p8tx[LEN_TxAPDU+2]=p8rx[2];//OAD
					p8tx[LEN_TxAPDU+3]=p8rx[3];//OAD
					p8tx[LEN_TxAPDU+4]=0;//Get-Result∷=CHOICE,错误信息  [0]   DAR
					p8tx[LEN_TxAPDU+5]=32;//时间标签无效(32)
					LEN_TxAPDU+=6;
					break;
				}
			}
			
			UARTCtrl->NEXT=0;//DL698分帧标志:0=不分帧,1=分帧第1帧,2=分帧中间帧,3=分帧最后帧
			UARTCtrl->NEXTBlock=1;//DL698分帧传输过程的帧序号，取值范围0~4095
			UARTCtrl->NEXTOADNum=0;//DL698分帧还需传输的OAD个数
			UARTCtrl->pRxBuff=(u32)p8rx;
			UARTCtrl->NEXTOADSubNum=0;//DL698分帧传输OAD内子计数
			
			OAD=(p8rx[0]<<24)+(p8rx[1]<<16)+(p8rx[2]<<8)+p8rx[3];
			p8tx[LEN_TxAPDU+0]=p8rx[0];//OAD
			p8tx[LEN_TxAPDU+1]=p8rx[1];//OAD
			p8tx[LEN_TxAPDU+2]=p8rx[2];//OAD
			p8tx[LEN_TxAPDU+3]=p8rx[3];//OAD
			LEN_TxAPDU+=4;
			LENmax_TxSPACE-=4;
			LEN_OAD=GET_OAD_DATA(PORTn,OAD,p8tx+LEN_TxAPDU+1,LENmax_TxSPACE-1);
			if(UARTCtrl->DAR!=0)//数据访问结果
			{
				p8tx[LEN_TxAPDU+0]=0;//Get-Result∷=CHOICE,错误信息  [0]   DAR
				p8tx[LEN_TxAPDU+1]=UARTCtrl->DAR;
				LEN_TxAPDU+=2;
			}
			else
			{
				p8tx[LEN_TxAPDU]=1;//Get-Result∷=CHOICE, [1]   DATA
				LEN_TxAPDU+=LEN_OAD+1;
			}
			break;
		case 2://读取若干个对象属性请求           [2] GetRequestNormalList，
//GetRequestNormalList∷=SEQUENCE
//{
//  服务序号-优先级       PIID，
//  若干个对象属性描述符  SEQUENCE OF OAD
//}
//GetResponseNormalList∷=SEQUENCE
//{
//  服务序号-优先级-ACD     PIID-ACD，
//  若干个对象属性及其结果  SEQUENCE OF A-ResultNormal
//}
			p8tx+=TxAPDUOffset;//TxAPDU存放开始地址
			p8tx[0]=133;//读取响应         	[133]	GET-Response
			p8tx[1]=2;//读取若干个对象属性响应   	[2] 
			p8tx[2]=UARTCtrl->PIID;//PIID-ACD
			p8tx[3]=0;//SEQUENCE OF
			LEN_TxAPDU=4;
			LENmax_TxSPACE-=LEN_TxAPDU;
		
			x=p8rx[LEN_SA+8+3];//SEQUENCE OF
			p8rx+=LEN_SA+8+4;
			while(x--)
			{
				if(LENmax_TxSPACE<6)
				{
					GET_Request_Frame(PORTn);//分帧标志
					break;//发送缓冲不够
				}
				UARTCtrl->NEXT=0;//DL698分帧标志:0=不分帧,1=分帧第1帧,2=分帧中间帧,3=分帧最后帧
				UARTCtrl->NEXTBlock=1;//DL698分帧传输过程的帧序号，取值范围0~4095
				UARTCtrl->NEXTOADNum=x;//DL698分帧还需传输的OAD个数
				UARTCtrl->pRxBuff=(u32)p8rx;
				UARTCtrl->NEXTOADSubNum=0;//DL698分帧传输OAD内子计数
				
				OAD=(p8rx[0]<<24)+(p8rx[1]<<16)+(p8rx[2]<<8)+p8rx[3];
				p8tx[LEN_TxAPDU+0]=p8rx[0];//OAD
				p8tx[LEN_TxAPDU+1]=p8rx[1];//OAD
				p8tx[LEN_TxAPDU+2]=p8rx[2];//OAD
				p8tx[LEN_TxAPDU+3]=p8rx[3];//OAD
				LENmax_TxSPACE-=4;
				LEN_OAD=GET_OAD_DATA(PORTn,OAD,p8tx+LEN_TxAPDU+4+1,LENmax_TxSPACE-1);
				if(UARTCtrl->NEXT!=0)//DL698分帧传输标志:0=不分帧,1=分帧第1帧,2=分帧中间帧,3=分帧最后帧;B7位=1表示已在发送区的APDU再分帧传输
				{
					break;
				}
				LEN_TxAPDU+=4;
				if(UARTCtrl->DAR!=0)//数据访问结果
				{
					p8tx[LEN_TxAPDU+0]=0;//Get-Result∷=CHOICE,错误信息  [0]   DAR
					p8tx[LEN_TxAPDU+1]=UARTCtrl->DAR;
					LEN_TxAPDU+=2;
					LENmax_TxSPACE-=2;
				}
				else
				{
					p8tx[LEN_TxAPDU]=1;//Get-Result∷=CHOICE, [1]   DATA
					LEN_TxAPDU+=LEN_OAD+1;
					LENmax_TxSPACE-=LEN_OAD+1;
				}
				p8rx+=4;
				p8tx[3]++;//+1(SEQUENCE OF)
			}
			break;
		case 3://读取一个记录型对象属性请求       [3] GetRequestRecord，
//GetRequestRecord∷=SEQUENCE
//{
//  服务序号-优先级         PIID，
//  读取一个记录型对象属性  GetRecord
//}
//GetRecord∷=SEQUENCE
//{
//  对象属性描述符     OAD，
//  记录选择描述符     RSD，
//  记录列选择描述符   RCSD
//}
			p8tx+=TxAPDUOffset;//TxAPDU存放开始地址
			p8rx+=LEN_SA+8+3;
			LEN_OAD=GET_RecordOAD(PORTn,p8rx);//读一个记录型对象属性;返回:b31-b16接收ROAD及数据字节数,b15-b0发送ROAD及数据字节数,数据访问结果UARTCtrl->DAR
			p8rx+=LEN_OAD>>16;
			LEN_TxAPDU=LEN_OAD&0xffff;
			if(UARTCtrl->DAR!=0)//数据访问结果
			{
				p8tx[LEN_TxAPDU+0]=0;//Get-Result∷=CHOICE,错误信息  [0]   DAR
				p8tx[LEN_TxAPDU+1]=UARTCtrl->DAR;
				LEN_TxAPDU+=2;
				LENmax_TxSPACE-=2;
			}
			break;
		case 4://读取若干个记录型对象属性请求	  [4] GetRequestRecordList，
//GetRequestRecordList∷=SEQUENCE
//{
//  服务序号-优先级           PIID，
//  读取若干个记录型对象属性  SEQUENCE OF GetRecord
//}
//GetResponseRecordList∷=SEQUENCE
//{
//  服务序号-优先级-ACD           PIID-ACD，
//  若干个记录型对象属性及其结果  SEQUENCE OF A-ResultRecord
//}
			p8tx+=TxAPDUOffset;//TxAPDU存放开始地址
			x=p8rx[LEN_SA+8+3];//SEQUENCE OF
			p8rx+=LEN_SA+8+4;
			ms=Get_ms();
			LEN_TxAPDU=0;
			pDATA=0;
			for(i=0;i<x;i++)
			{
				LEN_OAD=GET_RecordOAD(PORTn,p8rx);//读一个记录型对象属性;返回:b31-b16接收ROAD及数据字节数,b15-b0发送ROAD及数据字节数,数据访问结果UARTCtrl->DAR
				p8rx+=LEN_OAD>>16;
				TI=LEN_OAD&0xffff;
//				if(UARTCtrl->DAR!=0)//数据访问结果
//				{
//					p8tx[LEN_TxAPDU+0]=0;//Get-Result∷=CHOICE,错误信息  [0]   DAR
//					p8tx[LEN_TxAPDU+1]=UARTCtrl->DAR;
//					LEN_TxAPDU+=2;
//					LENmax_TxSPACE-=2;
//				}
				if(pDATA==0)
				{
					pDATA=(u8*)ms->ms_malloc(TI);
				}
				else
				{
					pDATA=(u8*)ms->ms_realloc(pDATA,LEN_TxAPDU+TI);
				}
				if(UARTCtrl->pTxData)
				{
					ms->ms_free(UARTCtrl->pTxData);
					ms->ms_free(pDATA);
					return;
				}
				if(pDATA==0)
				{
					return;
				}
				if(TI>=3)
				{
					TI-=3;
					MR((u32)pDATA+LEN_TxAPDU,(u32)p8tx+3,TI);//去开始3byte
					LEN_TxAPDU+=TI;//总发送数据长度
				}
			}
		//客户机接收缓冲长度
			ClientConnectInfo=(ClientConnectInfo_TypeDef*)UARTCtrl->ConnectInfo;//客户机连接信息
			LENmax_TxSPACE=Get_LEN_UARTnTx(PORTn);//最大还可发送的字节数
			LENmax_TxSPACE-=TxAPDUOffset+1;//1byte上报信息FollowReport OPTIONAL=0 表示没有
#if USE_ClientConnectInfo==0//使用客户机连接信息的客户机最大接收字节:0=不使用,1=使用
	ClientConnectInfo=ClientConnectInfo;
#else
	//客户机接收缓冲长度
	ClientConnectInfo=(ClientConnectInfo_TypeDef*)UARTCtrl->ConnectInfo;//客户机连接信息
	i=ClientConnectInfo->LEN_Rx;
	i=R_Inverse(i,2);//寄存器数据倒序(高低字节调换),入口:Data=寄存器中数据,Byte=需倒序的字节数;返回:倒序后的数据
	if(i<2048)
	{
		i=2048;
	}
	if(i>(TxAPDUOffset+1))
	{//不为0
		i-=(TxAPDUOffset+1);
		if(LENmax_TxSPACE>i)
		{
			LENmax_TxSPACE=i;
		}
	}
#endif
			
