gdgly/NUC97X_JS/STM32F4xx/DL698/DL698_GET.cpp
			if((LEN_TxAPDU+4)>LENmax_TxSPACE)
			{
				return;
			}
			p8tx[0]=0x85;
			p8tx[1]=4;
			p8tx[2]=UARTCtrl->PIID;
			p8tx[3]=x;//SEQUENCE OF
			MR((u32)p8tx+4,(u32)pDATA,LEN_TxAPDU);
			ms->ms_free(pDATA);
			LEN_TxAPDU+=4;
			
//	UARTCtrl->pTxData=0;//需发送数据缓冲指针(动态分配),分段组织,每段前有2字节段长度
//	UARTCtrl->LEN_TxData=0;//需发送数据总长度(包括每段前的2字节段长度)
//	UARTCtrl->LEN_ReadData=0;//已读取的发送数据总长度(包括每段前的2字节段长度)
			break;
		case 5://读取分帧响应的下一个数据块请求	  [5] GetRequestNext
//GetRequestNext∷=SEQUENCE
//{
//  服务序号-优先级                PIID，
//  正确接收的最近一次数据块序号   long-unsigned
//}
//GetResponseNext∷=SEQUENCE
//{
//  服务序号-优先级-ACD  	PIID-ACD，
//  末帧标志           	BOOLEAN，
//分帧序号           	long-unsigned，
//分帧响应             	CHOICE
//{
//错误信息    	    	[0]   DAR，
//  对象属性         	[1]   SEQUENCE OF A-ResultNormal，
//  记录型对象属性    	[2]   SEQUENCE OF A-ResultRecord
//}
//}
			p16=(u16 *)Get_ADDR_UARTnTimer_S(PORTn);//秒定时器
			p16[0]=TimerS_UARTRAMFREE;
		//68 15 00 43 05 01 00 00 00 00 00 10 04 5D 05 05 0F 00 02 00 81 1A 16
			p8rx+=LEN_SA+8+3;
			i=(p8rx[0]<<8)+p8rx[1];//正确接收的最近一次数据块序号
			x=UARTCtrl->NEXTBlock;
			UARTCtrl->NEXTBlock=i+1;
			if(i!=x)
			{//序号错
				UARTCtrl->NEXT=0;//DL698分帧传输标志:0=不分帧,1=分帧第1帧,2=分帧中间帧,3=分帧最后帧;B7位=1表示已在发送区的APDU再分帧传输
				p8tx+=TxAPDUOffset;//TxAPDU存放开始地址
				p8tx[0]=133;//读取响应         	[133]	GET-Response
				p8tx[1]=5;//[[5] GetRequestNext
				p8tx[2]=UARTCtrl->PIID;//PIID-ACD
				p8tx[3]=1;//未帧标志
				p8tx[4]=UARTCtrl->NEXTBlock>>8;//正确接收的最近一次数据块序号
				p8tx[5]=UARTCtrl->NEXTBlock;
				p8tx[6]=0;//分帧响应             	CHOICE
				p8tx[7]=255;//错误类型:255
				LEN_TxAPDU=8;
				break;
			}
			//copy rx+Rxoffset到rx
			p8rx=(u8 *)Get_ADDR_UARTnRx(PORTn);
			x=p8rx[Rxoffset+1]+(p8rx[Rxoffset+2]<<8);//原接收帧总长度
			x+=3;//整半字
			x>>=1;
			x<<=1;
			i=Get_LEN_UARTnRx(PORTn);
			if((Rxoffset+x)>i)
			{
				x=i-Rxoffset;
			}
			x/=2;
			p16=(u16*)p8rx;
			for(i=0;i<x;i++)
			{
				p16[i]=p16[(Rxoffset/2)+i];
			}
			p8tx=(u8 *)Get_ADDR_UARTnTx(PORTn);
			switch(UARTCtrl->GET_Reques_CHOICE)//原得到请求选择
			{
				case 1://读取一个对象属性请求
					p8tx+=TxAPDUOffset;//TxAPDU存放开始地址
					p8tx[0]=133;//读取响应         	[133]	GET-Response
					p8tx[1]=5;//[1] GetRequestNormal,[5]  GetResponseNext
					p8tx[2]=UARTCtrl->PIID;//PIID-ACD
					LEN_TxAPDU=3;
					LENmax_TxSPACE-=LEN_TxAPDU;
					p8rx=(u8*)UARTCtrl->pRxBuff;
					OAD=(p8rx[0]<<24)+(p8rx[1]<<16)+(p8rx[2]<<8)+p8rx[3];
					p8tx[LEN_TxAPDU+0]=p8rx[0];//OAD
					p8tx[LEN_TxAPDU+1]=p8rx[1];//OAD
					p8tx[LEN_TxAPDU+2]=p8rx[2];//OAD
					p8tx[LEN_TxAPDU+3]=p8rx[3];//OAD
					LEN_TxAPDU+=4;
					LENmax_TxSPACE-=4;
					LEN_OAD=GET_OAD_DATA(PORTn,OAD,p8tx+LEN_TxAPDU+1,LENmax_TxSPACE-1);
					if(UARTCtrl->DAR!=0)//数据访问结果
					{
						p8tx[LEN_TxAPDU+0]=0;//Get-Result∷=CHOICE,错误信息  [0]   DAR
						p8tx[LEN_TxAPDU+1]=UARTCtrl->DAR;
						LEN_TxAPDU+=2;
					}
					else
					{
						p8tx[LEN_TxAPDU]=1;//Get-Result
						LEN_TxAPDU+=LEN_OAD+1;
					}
					break;
				case 2://读取若干个对象属性请求
					p8tx+=TxAPDUOffset;//TxAPDU存放开始地址
					p8tx[0]=133;//读取响应         	[133]	GET-Response
					p8tx[1]=5;//读取若干个对象属性响应   	[2] ,[5]  GetResponseNext
					p8tx[2]=UARTCtrl->PIID;//PIID-ACD
					p8tx[3]=0;//SEQUENCE OF
					LEN_TxAPDU=4;
					LENmax_TxSPACE-=LEN_TxAPDU;
				
					x=UARTCtrl->NEXTOADNum;//x=p8rx[LEN_SA+8+3];//SEQUENCE OF
					p8rx=(u8*)UARTCtrl->pRxBuff;//p8rx+=LEN_SA+8+4;
					while(x--)
					{
						if(LENmax_TxSPACE<6)
						{
							GET_Request_Frame(PORTn);//分帧标志
							break;//发送缓冲不够
						}
						//UARTCtrl->NEXT=0;//DL698分帧标志:0=不分帧,1=分帧第1帧,2=分帧中间帧,3=分帧最后帧
						//UARTCtrl->NEXTBlock=1;//DL698分帧传输过程的帧序号，取值范围0~4095
						UARTCtrl->NEXTOADNum=x;//DL698分帧还需传输的OAD个数
						UARTCtrl->pRxBuff=(u32)p8rx;
						UARTCtrl->NEXTOADSubNum=0;//DL698分帧传输OAD内子计数
						
						OAD=(p8rx[0]<<24)+(p8rx[1]<<16)+(p8rx[2]<<8)+p8rx[3];
						p8tx[LEN_TxAPDU+0]=p8rx[0];//OAD
						p8tx[LEN_TxAPDU+1]=p8rx[1];//OAD
						p8tx[LEN_TxAPDU+2]=p8rx[2];//OAD
						p8tx[LEN_TxAPDU+3]=p8rx[3];//OAD
						LEN_TxAPDU+=4;
						LENmax_TxSPACE-=4;
						LEN_OAD=GET_OAD_DATA(PORTn,OAD,p8tx+LEN_TxAPDU+1,LENmax_TxSPACE-1);
						if(UARTCtrl->NEXT!=0)//DL698分帧传输标志:0=不分帧,1=分帧第1帧,2=分帧中间帧,3=分帧最后帧;B7位=1表示已在发送区的APDU再分帧传输
						{
							break;
						}
						if(UARTCtrl->DAR!=0)//数据访问结果
						{
							p8tx[LEN_TxAPDU+0]=0;//Get-Result∷=CHOICE,错误信息  [0]   DAR
							p8tx[LEN_TxAPDU+1]=UARTCtrl->DAR;
							LEN_TxAPDU+=2;
							LENmax_TxSPACE-=2;
						}
						else
						{
							p8tx[LEN_TxAPDU]=1;//数据
							LEN_TxAPDU+=LEN_OAD+1;
							LENmax_TxSPACE-=LEN_OAD+1;
						}
						p8rx+=4;
						p8tx[3]++;//+1(SEQUENCE OF)
					}
					break;
				case 3://读取一个记录型对象属性请求
					LEN_TxAPDU=GET_RecordOAD_Next(PORTn);//读一个记录型对象属性分帧响应的下一帧;返回：LEN_TxAPDU
					if(LEN_TxAPDU==0)
					{
						UARTCtrl->NEXT=0;//DL698分帧传输标志:0=不分帧,1=分帧第1帧,2=分帧中间帧,3=分帧最后帧;B7位=1表示已在发送区的APDU再分帧传输
						p8tx+=TxAPDUOffset;//TxAPDU存放开始地址
						p8tx[0]=133;//读取响应         	[133]	GET-Response
						p8tx[1]=5;//[[5] GetRequestNext
						p8tx[2]=UARTCtrl->PIID;//PIID-ACD
						p8tx[3]=1;//未帧标志
						p8tx[4]=UARTCtrl->NEXTBlock>>8;//正确接收的最近一次数据块序号
						p8tx[5]=UARTCtrl->NEXTBlock;
						p8tx[6]=0;//分帧响应             	CHOICE
						p8tx[7]=255;//错误类型:255
						LEN_TxAPDU=8;
					}
					break;
				case 4://读取若干个记录型对象属性请求
					LEN_TxAPDU=GET_RecordOAD_Next(PORTn);//读一个记录型对象属性分帧响应的下一帧;返回：LEN_TxAPDU
					if(LEN_TxAPDU==0)
					{//下一个记录
						UARTCtrl->NEXT=0;//DL698分帧传输标志:0=不分帧,1=分帧第1帧,2=分帧中间帧,3=分帧最后帧;B7位=1表示已在发送区的APDU再分帧传输
						p8tx+=TxAPDUOffset;//TxAPDU存放开始地址
						p8tx[0]=133;//读取响应         	[133]	GET-Response
						p8tx[1]=5;//[[5] GetRequestNext
						p8tx[2]=UARTCtrl->PIID;//PIID-ACD
						p8tx[3]=1;//未帧标志
						p8tx[4]=UARTCtrl->NEXTBlock>>8;//正确接收的最近一次数据块序号
						p8tx[5]=UARTCtrl->NEXTBlock;
						p8tx[6]=0;//分帧响应             	CHOICE
						p8tx[7]=255;//错误类型:255
						LEN_TxAPDU=8;
					}
					break;
				default:
					return;
			}
			break;
		default:
			return;
	}
	TI=0;
	Uart_698_TxResponse(PORTn,TI,LEN_TxAPDU);//DL698发送响应数据,数据已在p8tx+TxAPDUOffset的开始地址中
}


void GET_Request_Frame(u32 PORTn)//分帧标志
{
	UARTCtrl_TypeDef *UARTCtrl;
	UARTCtrl=(UARTCtrl_TypeDef *)Get_ADDR_UARTnCtrl(PORTn);
	if(UARTCtrl->NEXT==0)//DL698分帧传输标志:0=不分帧,1=分帧第1帧,2=分帧中间帧,3=分帧最后帧;B7位=1表示已在发送区的APDU再分帧传输
	{
		UARTCtrl->NEXT=1;//DL698分帧传输标志:0=不分帧,1=分帧第1帧,2=分帧中间帧,3=分帧最后帧;B7位=1表示已在发送区的APDU再分帧传输
	}
	else
	{
		UARTCtrl->NEXT=2;//DL698分帧传输标志:0=不分帧,1=分帧第1帧,2=分帧中间帧,3=分帧最后帧;B7位=1表示已在发送区的APDU再分帧传输
	}
}

