gdgly/NUC97X_JS/STM32F4xx/DL698/DL698_GET.cpp
u32 GET_OAD_Element(u32 PORTn,u8* ADDR_OAD,u32 Element,u32 LENmax_OAD,u8 *p8tx,u32 LENmax_TxSPACE)//读一个对象元素;返回:本对象的数据长度(不包括4字节OAD),数据访问结果UARTCtrl->DAR
{
	u32 Len;
	u8* p8;
	UARTCtrl_TypeDef *UARTCtrl;
	
	UARTCtrl=(UARTCtrl_TypeDef *)Get_ADDR_UARTnCtrl(PORTn);
	p8=Get_Element(ADDR_OAD,Element,0,LENmax_OAD);//计算元素地址,使用ADDR_128KDATABUFF
	if(p8==0)
	{
		UARTCtrl->DAR=6;//对象不存在
		return 0;
	}
	Len=Get_DL698DataLen_S(p8,0);//得到DL698数据类型长度(包括:类型字节和数据);入口:LENmax仅取NAND数据时先读到ADDR_128KDATABUFF用,返回:长度
	if(Len>LENmax_TxSPACE)
	{
		GET_Request_Frame(PORTn);//分帧标志
		return 0;
	}
	if(Len==0)
	{
		if(LENmax_TxSPACE<1)
		{
			GET_Request_Frame(PORTn);//分帧标志
			return 0;
		}
		p8tx[0]=0;//NULL
		return 1;
	}
	MR((u32)p8tx,(u32)p8,Len);
	return Len;
}



u32 GET_OAD_DATA(u32 PORTn,u32 OAD,u8 *p8tx,u32 LENmax_TxSPACE)//读一个对象属性;返回:本对象的数据长度,数据访问结果UARTCtrl->DAR
{
//  一个对象属性描述符   OAD
//OAD∷=SEQUENCE
//{
//  对象标识          OI，
//  属性标识及其特征  bit-string（SIZE（8）），
//  属性内元素索引    unsigned（1…255）
//}
//对象属性标识及其特征——用bit0…bit7表示八位位组的最低位到最高位，其中：
//1)	bit0…bit4编码表示对象属性编号，取值0…31，其中0表示整个对象属性，即对象的所有属性；
//2)	bit5…bit7编码表示属性特征，属性特征是对象同一个属性在不同快照环境下取值模式，取值0…7，特征含义在具体类属性中描述。
//属性内元素索引——00H表示整个属性全部内容。如果属性是一个结构或数组，01H指向对象属性的第一个元素；如果属性是一个记录型的存储区，非零值n表示最近第n次的记录。

//A-ResultNormal∷=SEQUENCE
//{
//  对象属性描述符  OAD，
//  及其结果        Get-Result
//}
//Get-Result∷=CHOICE
//{
//  错误信息  [0]   DAR，
//  数据      [1]   Data
//}
	u32 Len;
	DL698_SETLIB_TypeDef *pLib;
	UARTCtrl_TypeDef *UARTCtrl;
	
	
	UARTCtrl=(UARTCtrl_TypeDef *)Get_ADDR_UARTnCtrl(PORTn);
	UARTCtrl->DAR=0;//数据访问结果;成功

	if((OAD&0xff00)==0x0100)
	{//读逻辑名
		if(LENmax_TxSPACE<4)
		{
			GET_Request_Frame(PORTn);//分帧标志
			return 0;
		}
		p8tx[0]=DataType_octet_string;//long-unsigned
		p8tx[1]=2;
		p8tx[2]=OAD>>24;
		p8tx[3]=OAD>>16;
		return 4;
	}
	if((OAD>>24)==0x44)
	{//应用连接IO列表
		Len=GET_OAD_ConnectApp(PORTn,OAD,p8tx,LENmax_TxSPACE);//读应用连接可访问对象列表;返回:本对象的数据长度,数据访问结果UARTCtrl->DAR
		return Len;
	}
	if(((OAD>>16)&0xff00)<0x2100)
	{//iMeter
		Len=GET_iMeter_OAD(PORTn,OAD,p8tx,LENmax_TxSPACE);//读一个对象属性;返回:本对象的数据长度,数据访问结果UARTCtrl->DAR
		return Len;
	}
	
#if (USER/100)==17//???
	if((OAD&0xffffff00)==0x40480200)
	{
		pLib=Get_DL698_SET_pLib(OAD&0xffffff00);//??DATA_pLib??;??:OAD;??:Lib??(=0??????OI)
		if(pLib==0)
		{
			UARTCtrl->DAR=6;//?????           (6)
			return 0;
		}
		MR((u32)p8tx,pLib->Addr,8);
		return 8;
		//MR((u32)p8tx,ADDR_4048_127,8);
		//return 8;
	}
	if((OAD&0xffffff00)==0x45000C00)
	{
		Len=Get_Request_4500(PORTn,OAD,p8tx,LENmax_TxSPACE);
		return Len;
	}
#endif
#if (USER/100)==15//安徽专变
	if((OAD&0xffffff00)==0x31060B00)
	{//安徽专变终端停/上电事件属性11配置参数2
 			pLib=Get_DL698_SET_pLib(OAD&0xffffff00);//得到DATA_pLib指针;入口:OAD;返回:Lib指针(=0表示无相应的OI)
			if(pLib==0)
			{
				UARTCtrl->DAR=6;//对象不存在           （6）
				return 0;
			}
			MR((u32)p8tx,pLib->Addr,4);
			return 4;
	}
#endif
	if(((OAD>>16)&0xf000)==0x3000)
	{//事件
		Len=GET_EVENT_OAD(PORTn,OAD,p8tx,LENmax_TxSPACE);//读一个对象属性;返回:本对象的数据长度,数据访问结果UARTCtrl->DAR
		return Len;
	}
	if((OAD>>16)==0xF001)
	{//文件传输
		Len=GET_Request_F001(PORTn,OAD,p8tx,LENmax_TxSPACE);//读一个对象属性;返回:本对象的数据长度,数据访问结果UARTCtrl->DAR
		return Len;
	}
	if((OAD>>16)==0xF100)
	{//ESAM
		Len=GET_ESAM_OAD(PORTn,OAD,p8tx,LENmax_TxSPACE);//读一个对象属性;返回:本对象的数据长度,数据访问结果UARTCtrl->DAR
		return Len;
	}
	if(((OAD>>16)&0xff00)==0xF200)
	{//输入输出设备类
		Len=GET_Request_F200(pLib,PORTn,OAD,p8tx,LENmax_TxSPACE);//读一个对象属性;返回:本对象的数据长度,数据访问结果UARTCtrl->DAR
		if(Len)
		{
			return Len;
		}
		UARTCtrl->DAR=0;//数据访问结果;成功
	}
	
#if (USER/100)==9//河南
	if(OAD==0xff100200)//电表接线错误信息表
	{
		Len=GET_Request_FF10(pLib,PORTn,OAD,p8tx,LENmax_TxSPACE);//读一个对象属性;返回:本对象的数据长度,数据访问结果UARTCtrl->DAR
		if(Len)
		{
			return Len;
		}
		UARTCtrl->DAR=6;//对象不存在（6）
		return 0;
	}
#endif
#if MeterSpec==20//自动适应电能表规格
	switch(OAD)
	{
		case 0x41040200://额定电压
		case 0x41050200://额定电流/基本电流
		case 0x41060200://最大电流
		case 0x41090200://电能表有功常数
		case 0x410A0200://电能表无功常数
			 Len=GET_Request_4100(PORTn,OAD,p8tx,LENmax_TxSPACE);
				return Len;
	}
#endif
	if(((OAD>>24)==0x23)||((OAD>>24)==0x24))
	{//脉冲输入，总加组
		Len=GET_23xx_24xx(PORTn,OAD,p8tx,LENmax_TxSPACE);//读总加组和脉冲计量;返回:本对象的数据长度,数据访问结果UARTCtrl->DAR
		return Len;
	}
	pLib=Get_DL698_DATA_pLib(OAD&0xffffff00);//得到DATA_pLib指针;入口:OAD;返回:Lib指针(=0表示无相应的OI)
	if(pLib==0)
	{
		pLib=Get_DL698_SET_pLib(OAD&0xffffff00);//得到SET_pLib指针;入口:OAD;返回:Lib指针(=0表示无相应的OI)
		if(pLib==0)
		{
			Len=GET_OAD_FactoryTest(PORTn,OAD,p8tx,LENmax_TxSPACE);//读工厂测试结果;返回:本对象的数据长度,数据访问结果UARTCtrl->DAR
			if(Len)
			{
				return Len;
			}
			UARTCtrl->DAR=6;//对象不存在（6）
			return 0;
		}
	}
	if(OAD&0xff00)
	{//单个属性
		if((OAD&0xff)==0)
		{//全部元素
			switch(OAD)
			{
				case 0x60000200://采集档案配置表
				case 0x60120200://任务配置表
				case 0x60140200://普通采集方案
				case 0x60160200://事件采集方案
				case 0x60180200://透明方案
				case 0x601A0200://透明方案结果
				case 0x601C0200://上报方案
				case 0x601E0200://采集规则库
				case 0x60320200://采集状态集
				case 0x60340200://采集任务监控集
					Len=GET_Request_6000(pLib,PORTn,OAD,p8tx,LENmax_TxSPACE);//读一个对象属性;返回:本对象的数据长度,数据访问结果UARTCtrl->DAR
					return Len;
				case 0x60020200://所有搜表结果
				case 0x60020300://当前元素个数.所有搜表结果
				case 0x60020400://最大元素个数,所有搜表结果
				case 0x60020500://跨台区搜表结果
				case 0x60020600://所有搜表结果记录数
				case 0x60020700://跨台区搜表结果记录数
					Len=GET_Request_6002(PORTn,OAD,p8tx,LENmax_TxSPACE);//读一个对象属性;返回:本对象的数据长度,数据访问结果UARTCtrl->DAR
					return Len;
				
				case 0x60000300://当前元素个数.采集档案配置表
				case 0x60140300://当前元素个数.普通采集方案集
				case 0x60160300://当前元素个数.事件采集方案集
				case 0x60180300://当前元素个数.透明方案集
				case 0x601A0300://当前元素个数.透明方案结果
				case 0x601C0300://当前元素个数.上报方案集
				case 0x601E0300://当前元素个数.采集规则库
				case 0x60320300://当前元素个数.采集状态集
				case 0x60340300://当前元素个数.采集任务监控集
					if(LENmax_TxSPACE<3)
					{
						GET_Request_Frame(PORTn);//分帧标志
						return 0;
					}
					Len=GET_NUMper(pLib);//计算当前元素个数
					p8tx[0]=DataType_long_unsigned;
					p8tx[1]=Len>>8;
					p8tx[2]=Len;
					return 3;
				case 0x60000400://最大元素个数.采集档案配置表
				case 0x60140400://最大元素个数.普通采集方案集
				case 0x60160400://最大元素个数.事件采集方案集
				case 0x60180400://最大元素个数.透明方案集
				case 0x601A0400://最大元素个数.透明方案结果
				case 0x601C0400://最大元素个数.上报方案集
				case 0x601E0400://最大元素个数.采集规则库
				case 0x60320400://最大元素个数.采集状态集
				case 0x60340400://最大元素个数.采集任务监控集
					if(LENmax_TxSPACE<3)
					{
						GET_Request_Frame(PORTn);//分帧标志
						return 0;
					}
					Len=pLib->LENmax/pLib->LENper;
					p8tx[0]=DataType_long_unsigned;
					p8tx[1]=Len>>8;
					p8tx[2]=Len;;
					return 3;
				case 0xF2000300://设备对象数-RS232
				case 0xF2010300://设备对象数-RS485
				case 0xF2020300://设备对象数-红外
				case 0xF2030300://设备对象数-开关量
				case 0xF2040300://设备对象数-直流模拟量
				case 0xF2050300://设备对象数-继电器输出
				case 0xF2060300://设备对象数-告警输出
				case 0xF2070300://设备对象数-多功能端子
				case 0xF2090300://设备对象数-载波/微功率无线接口
				case 0xF20A0300://设备对象数-脉冲输入设备
				case 0xF20B0300://蓝牙
					if(LENmax_TxSPACE<2)
					{
						GET_Request_Frame(PORTn);//分帧标志
						return 0;
					}
					p8tx[0]=DataType_unsigned;
					p8tx[1]=pLib->LENmax;//设备对象数
					return 2;

				case 0x40000200://日期时间
					Len=8;
					break;
				default:
					Len=Get_DL698DataLen((u8*)pLib->Addr,(Attribute_TypeDef *)pLib->pDataType,0,pLib->LENmax);//得到DL698数据类型长度(包括:类型字节和数据);入口:LENmax仅取NAND数据时先读到ADDR_128K_DATABUFF用,返回:b31-b8长度,b7-b0元素计数
					if(pLib->pDataType)
					{
						if((Len&0xff)==0)
						{
							UARTCtrl->DAR=7;//类型不匹配           （7）
							return 0;
						}
					}
					Len>>=8;
					break;
			}
			if(Len>pLib->LENmax)
			{
				if(pLib->LENmax!=0)
				{//数据是存储在FLASH
					UARTCtrl->DAR=9;//数据块不可用         （9）
					return 0;
				}
			}
			if(Len>LENmax_TxSPACE)
			{
				GET_Request_Frame(PORTn);//分帧标志
				return 0;
			}
			switch(OAD>>16)
			{
				case 0x4000://日期时间
					if((OAD&0xff00)==0x200)
					{//属性=2
						p8tx[0]=DataType_date_time_s;
						MR((u32)p8tx+1,pLib->Addr,7);
						Len=8;
						break;
					}
				default:
					if((pLib->rw&0x1)||(Comm_Ram->Factory==0x55))
					{
						MR((u32)p8tx,pLib->Addr,Len);
					}
					else
					{//不允许读
						UARTCtrl->DAR=3;//数据访问结果;拒绝读写             （3）
						return 0;
					}
					break;
			}
		}
		else
		{//单个元素
			Len=GET_OAD_Element(PORTn,(u8*)pLib->Addr,OAD&0xff,pLib->LENmax,p8tx,LENmax_TxSPACE);//读一个对象元素;;返回:本对象的数据长度(不包括4字节OAD),数据访问结果UARTCtrl->DAR
		}
		
//正确读后处理
		switch(OAD)
		{
			case 0xF2030200://读取开关量输入开关量单元
				CLR_SwitchIn_CD();//清开关量输入变位CD 
				break;
		}
		return Len;
	}
	else
	{//0表示整个对象属性，即对象的所有属性
		UARTCtrl->DAR=3;//数据访问结果;拒绝读写             （3）
		return 0;
	}
}




























